HAMES2-1st-3/TunnelComfortSystemTesting/include/tc27xa/IfxScu_regdef.h
/** \\brief  External Input Channel Register */
typedef struct _Ifx_SCU_EICR_Bits
{
    unsigned int reserved_0:4;              /**< \brief \internal Reserved */
    unsigned int EXIS0:3;                   /**< \brief [6:4] External Input Selection 0 (rw) */
    unsigned int reserved_7:1;              /**< \brief \internal Reserved */
    unsigned int FEN0:1;                    /**< \brief [8:8] Falling Edge Enable 0 (rw) */
    unsigned int REN0:1;                    /**< \brief [9:9] Rising Edge Enable 0 (rw) */
    unsigned int LDEN0:1;                   /**< \brief [10:10] Level Detection Enable 0 (rw) */
    unsigned int EIEN0:1;                   /**< \brief [11:11] External Input Enable 0 (rw) */
    unsigned int INP0:3;                    /**< \brief [14:12] Input Node Pointer (rw) */
    unsigned int reserved_15:5;             /**< \brief \internal Reserved */
    unsigned int EXIS1:3;                   /**< \brief [22:20] External Input Selection 1 (rw) */
    unsigned int reserved_23:1;             /**< \brief \internal Reserved */
    unsigned int FEN1:1;                    /**< \brief [24:24] Falling Edge Enable 1 (rw) */
    unsigned int REN1:1;                    /**< \brief [25:25] Rising Edge Enable 1 (rw) */
    unsigned int LDEN1:1;                   /**< \brief [26:26] Level Detection Enable 1 (rw) */
    unsigned int EIEN1:1;                   /**< \brief [27:27] External Input Enable 1 (rw) */
    unsigned int INP1:3;                    /**< \brief [30:28] Input Node Pointer (rw) */
    unsigned int reserved_31:1;             /**< \brief \internal Reserved */
} Ifx_SCU_EICR_Bits;

/** \\brief  External Input Flag Register */
typedef struct _Ifx_SCU_EIFR_Bits
{
    unsigned int INTF0:1;                   /**< \brief [0:0] External Event Flag of Channel x (rh) */
    unsigned int INTF1:1;                   /**< \brief [1:1] External Event Flag of Channel x (rh) */
    unsigned int INTF2:1;                   /**< \brief [2:2] External Event Flag of Channel x (rh) */
    unsigned int INTF3:1;                   /**< \brief [3:3] External Event Flag of Channel x (rh) */
    unsigned int INTF4:1;                   /**< \brief [4:4] External Event Flag of Channel x (rh) */
    unsigned int INTF5:1;                   /**< \brief [5:5] External Event Flag of Channel x (rh) */
    unsigned int INTF6:1;                   /**< \brief [6:6] External Event Flag of Channel x (rh) */
    unsigned int INTF7:1;                   /**< \brief [7:7] External Event Flag of Channel x (rh) */
    unsigned int reserved_8:24;             /**< \brief \internal Reserved */
} Ifx_SCU_EIFR_Bits;

/** \\brief  Emergency Stop Register */
typedef struct _Ifx_SCU_EMSR_Bits
{
    unsigned int POL:1;                     /**< \brief [0:0] Input Polarity (rw) */
    unsigned int MODE:1;                    /**< \brief [1:1] Mode Selection (rw) */
    unsigned int ENON:1;                    /**< \brief [2:2] Enable ON (rw) */
    unsigned int PSEL:1;                    /**< \brief [3:3] PORT Select (rw) */
    unsigned int reserved_4:12;             /**< \brief \internal Reserved */
    unsigned int EMSF:1;                    /**< \brief [16:16] Emergency Stop Flag (rh) */
    unsigned int SEMSF:1;                   /**< \brief [17:17] SMU Emergency Stop Flag (rh) */
    unsigned int reserved_18:6;             /**< \brief \internal Reserved */
    unsigned int EMSFM:2;                   /**< \brief [25:24] Emergency Stop Flag Modification (w) */
    unsigned int SEMSFM:2;                  /**< \brief [27:26] SMU Emergency Stop Flag Modification (w) */
    unsigned int reserved_28:4;             /**< \brief \internal Reserved */
} Ifx_SCU_EMSR_Bits;

/** \\brief  ESR Input Configuration Register */
typedef struct _Ifx_SCU_ESRCFG_Bits
{
    unsigned int reserved_0:4;              /**< \brief \internal Reserved */
    unsigned int DFEN:1;                    /**< \brief [4:4] Digital Filter Enable (rw) */
    unsigned int reserved_5:2;              /**< \brief \internal Reserved */
    unsigned int EDCON:2;                   /**< \brief [8:7] Edge Detection Control (rw) */
    unsigned int reserved_9:22;             /**< \brief \internal Reserved */
    unsigned int LCK:1;                     /**< \brief [31:31] Lock Status (rh) */
} Ifx_SCU_ESRCFG_Bits;

/** \\brief  ESR Output Configuration Register */
typedef struct _Ifx_SCU_ESROCFG_Bits
{
    unsigned int ARI:1;                     /**< \brief [0:0] Application Reset Indicator (rh) */
    unsigned int ARC:1;                     /**< \brief [1:1] Application Reset Indicator Clear (w) */
    unsigned int reserved_2:30;             /**< \brief \internal Reserved */
} Ifx_SCU_ESROCFG_Bits;

/** \\brief  EVR13 Control Register */
typedef struct _Ifx_SCU_EVR13CON_Bits
{
    unsigned int KP:4;                      /**< \brief [3:0] KP Value (rw) */
    unsigned int KI:4;                      /**< \brief [7:4] KI Value (rw) */
    unsigned int KD:4;                      /**< \brief [11:8] KD Value (rw) */
    unsigned int CTRL:4;                    /**< \brief [15:12] Reserved (rw) */
    unsigned int KPE:4;                     /**< \brief [19:16] KP Value (rw) */
    unsigned int KIE:4;                     /**< \brief [23:20] KI Value (rw) */
    unsigned int KDE:4;                     /**< \brief [27:24] KD Value (rw) */
    unsigned int EVR13OFF:1;                /**< \brief [28:28] EVR13 Regulator Enable (rw) */
    unsigned int BPEVR13OFF:1;              /**< \brief [29:29] Bit Protection EVR13OFF (w) */
    unsigned int reserved_30:1;             /**< \brief \internal Reserved */
    unsigned int LCK:1;                     /**< \brief [31:31] Lock Status (rh) */
} Ifx_SCU_EVR13CON_Bits;

/** \\brief  EVR33 Control Register */
typedef struct _Ifx_SCU_EVR33CON_Bits
{
    unsigned int KP:4;                      /**< \brief [3:0] KP Value (rw) */
    unsigned int KI:4;                      /**< \brief [7:4] KI Value (rw) */
    unsigned int KD:4;                      /**< \brief [11:8] KD Value (rw) */
    unsigned int CTRL:4;                    /**< \brief [15:12] Reserved (rw) */
    unsigned int KPE:4;                     /**< \brief [19:16] KP Value (rw) */
    unsigned int KIE:4;                     /**< \brief [23:20] KI Value (rw) */
    unsigned int KDE:4;                     /**< \brief [27:24] KD Value (rw) */
    unsigned int EVR33OFF:1;                /**< \brief [28:28] EVR33 Regulator Enable (rw) */
    unsigned int BPEVR33OFF:1;              /**< \brief [29:29] Bit Protection EVR33OFF (w) */
    unsigned int reserved_30:1;             /**< \brief \internal Reserved */
    unsigned int LCK:1;                     /**< \brief [31:31] Lock Status (rh) */
} Ifx_SCU_EVR33CON_Bits;

/** \\brief  EVR ADC Status Register */
typedef struct _Ifx_SCU_EVRADCSTAT_Bits
{
    unsigned int ADC13V:8;                  /**< \brief [7:0] ADC 13V Conversion Result (rh) */
    unsigned int ADC33V:8;                  /**< \brief [15:8] ADC 33V Conversion Result (rh) */
    unsigned int ADCSWDV:8;                 /**< \brief [23:16] ADC External Supply Conversion Result (rh) */
    unsigned int reserved_24:7;             /**< \brief \internal Reserved */
    unsigned int VAL:1;                     /**< \brief [31:31] Valid Status (rh) */
} Ifx_SCU_EVRADCSTAT_Bits;

/** \\brief  EVR Monitor Control Register */
typedef struct _Ifx_SCU_EVRMONCTRL_Bits
{
    unsigned int EVR13OVMOD:2;              /**< \brief [1:0] 13V Regulator Over-voltage monitoring mode (rw) */
    unsigned int reserved_2:2;              /**< \brief \internal Reserved */
    unsigned int EVR13UVMOD:2;              /**< \brief [5:4] 13V Regulator Under-voltage monitoring mode (rw) */
    unsigned int reserved_6:2;              /**< \brief \internal Reserved */
    unsigned int EVR33OVMOD:2;              /**< \brief [9:8] 33V Regulator Over-voltage monitoring mode (rw) */
    unsigned int reserved_10:2;             /**< \brief \internal Reserved */
    unsigned int EVR33UVMOD:2;              /**< \brief [13:12] 33V Regulator Under-voltage monitoring mode (rw) */
    unsigned int reserved_14:2;             /**< \brief \internal Reserved */
    unsigned int SWDOVMOD:2;                /**< \brief [17:16] Supply monitor SWD Over-voltage monitoring mode (rw) */
    unsigned int reserved_18:2;             /**< \brief \internal Reserved */
    unsigned int SWDUVMOD:2;                /**< \brief [21:20] Supply monitor SWD Under-voltage monitoring mode (rw) */
    unsigned int reserved_22:8;             /**< \brief \internal Reserved */
    unsigned int SLCK:1;                    /**< \brief [30:30] HSM Security Lock (rwh) */
    unsigned int reserved_31:1;             /**< \brief \internal Reserved */
} Ifx_SCU_EVRMONCTRL_Bits;

/** \\brief  EVR Over-voltage Configuration Register */
typedef struct _Ifx_SCU_EVROVMON_Bits
{
    unsigned int EVR13OVVAL:8;              /**< \brief [7:0] 13V Regulator Over-voltage threshold (rw) */
    unsigned int EVR33OVVAL:8;              /**< \brief [15:8] 33V Regulator Over-voltage threshold (rw) */
    unsigned int SWDOVVAL:8;                /**< \brief [23:16] Supply monitor SWD Over-voltage threshold value (rw) */
    unsigned int reserved_24:6;             /**< \brief \internal Reserved */
    unsigned int SLCK:1;                    /**< \brief [30:30] HSM Security Lock (rwh) */
    unsigned int LCK:1;                     /**< \brief [31:31] Lock Status (rh) */
} Ifx_SCU_EVROVMON_Bits;

/** \\brief  EVR Hard Reset Control Register */
typedef struct _Ifx_SCU_EVRRSTCON_Bits
{
    unsigned int RST13TRIM:8;               /**< \brief [7:0] 13V Regulator Reset Trim Value (rw) */
    unsigned int RST33TRIM:8;               /**< \brief [15:8] 33V Regulator Reset Trim Value (rw) */
    unsigned int RSTSWDTRIM:8;              /**< \brief [23:16] 50V/33V External Supply Reset Trim Value (rw) */
    unsigned int RST13OFF:1;                /**< \brief [24:24] Hard Reset EVR13 Enable (rw) */
    unsigned int BPRST13OFF:1;              /**< \brief [25:25] Bit Protection RST13OFF (w) */
    unsigned int RST33OFF:1;                /**< \brief [26:26] Hard Reset EVR33 Enable (rw) */
    unsigned int BPRST33OFF:1;              /**< \brief [27:27] Bit Protection RST33OFF (w) */
    unsigned int RSTSWDOFF:1;               /**< \brief [28:28] Hard Reset EVR Supply Monitor Enable (rw) */
    unsigned int BPRSTSWDOFF:1;             /**< \brief [29:29] Bit Protection RSTSWDOFF (w) */
    unsigned int SLCK:1;                    /**< \brief [30:30] HSM Security Lock (rwh) */
    unsigned int LCK:1;                     /**< \brief [31:31] Lock Status (rh) */
} Ifx_SCU_EVRRSTCON_Bits;

/** \\brief  EVR13 SD Control Register 1 */
typedef struct _Ifx_SCU_EVRSDCTRL1_Bits
{
    unsigned int SDFREQSPRD:16;             /**< \brief [15:0] Frequency Spread Threshold freq_spread_thr_i (rw) */
    unsigned int SDFREQ:8;                  /**< \brief [23:16] Regulator Switching Frequency os_factor_i (rw) */
    unsigned int SDSTEP:4;                  /**< \brief [27:24] Droop Voltage Step sd_droop_step_i (rw) */
    unsigned int reserved_28:2;             /**< \brief \internal Reserved */
    unsigned int SDSAMPLE:1;                /**< \brief [30:30] ADC Sampling Scheme sd_sample_time_i (rw) */
    unsigned int LCK:1;                     /**< \brief [31:31] Lock Status (rh) */
} Ifx_SCU_EVRSDCTRL1_Bits;

/** \\brief  EVR Status Flag Register */
typedef struct _Ifx_SCU_EVRSTAT_Bits
{
    unsigned int EVR13:1;                   /**< \brief [0:0] EVR13 status (rh) */
    unsigned int OV13:1;                    /**< \brief [1:1] EVR13 Regulator Over-voltage event flag (rh) */
    unsigned int EVR33:1;                   /**< \brief [2:2] EVR33 status (rh) */
    unsigned int OV33:1;                    /**< \brief [3:3] EVR33 Regulator Over-voltage event flag (rh) */
    unsigned int OVSWD:1;                   /**< \brief [4:4] Supply Monitor SWD Over-voltage event flag (rh) */
    unsigned int UV13:1;                    /**< \brief [5:5] EVR13 Regulator Under-voltage event flag (rh) */
    unsigned int UV33:1;                    /**< \brief [6:6] EVR33 Regulator Under-voltage event flag (rh) */
    unsigned int UVSWD:1;                   /**< \brief [7:7] Supply Monitor SWD Under-voltage event flag (rh) */
    unsigned int EXTPASS13:1;               /**< \brief [8:8] External Pass Device for EVR13 (rh) */
    unsigned int EXTPASS33:1;               /**< \brief [9:9] External Pass Device for EVR33 (rh) */
    unsigned int BGPROK:1;                  /**< \brief [10:10] Primary Bandgap status (rh) */
    unsigned int reserved_11:21;            /**< \brief \internal Reserved */
} Ifx_SCU_EVRSTAT_Bits;

/** \\brief  EVR Under-voltage Configuration Register */
typedef struct _Ifx_SCU_EVRUVMON_Bits
{
    unsigned int EVR13UVVAL:8;              /**< \brief [7:0] 13V Regulator Under-voltage threshold (rw) */
    unsigned int EVR33UVVAL:8;              /**< \brief [15:8] 33V Regulator Under-voltage threshold (rw) */
    unsigned int SWDUVVAL:8;                /**< \brief [23:16] Supply monitor SWD Under-voltage threshold value (rw) */
    unsigned int reserved_24:6;             /**< \brief \internal Reserved */
    unsigned int SLCK:1;                    /**< \brief [30:30] HSM Security Lock (rwh) */
    unsigned int LCK:1;                     /**< \brief [31:31] Lock Status (rh) */
} Ifx_SCU_EVRUVMON_Bits;

/** \\brief  External Clock Control Register */
typedef struct _Ifx_SCU_EXTCON_Bits
{
    unsigned int EN0:1;                     /**< \brief [0:0] External Clock Enable for EXTCLK0 (rwh) */
    unsigned int reserved_1:1;              /**< \brief \internal Reserved */
    unsigned int SEL0:4;                    /**< \brief [5:2] External Clock Select for EXTCLK0 (rwh) */
    unsigned int reserved_6:10;             /**< \brief \internal Reserved */
    unsigned int EN1:1;                     /**< \brief [16:16] External Clock Enable for EXTCLK1 (rwh) */
    unsigned int NSEL:1;                    /**< \brief [17:17] Negation Selection (rwh) */
    unsigned int SEL1:4;                    /**< \brief [21:18] External Clock Select for EXTCLK1 (rwh) */
    unsigned int reserved_22:2;             /**< \brief \internal Reserved */
    unsigned int DIV1:8;                    /**< \brief [31:24] External Clock Divider for EXTCLK1 (rw) */
} Ifx_SCU_EXTCON_Bits;

