HAMES2-1st-3/TunnelComfortSystemTesting/include/tc27xa/IfxScu_regdef.h
/** \\brief  LCL CPU Control Register */
typedef struct _Ifx_SCU_LCLCON_Bits
{
    unsigned int reserved_0:16;             /**< \brief \internal Reserved */
    unsigned int LS:1;                      /**< \brief [16:16] Lockstep Mode Status (rh) */
    unsigned int reserved_17:14;            /**< \brief \internal Reserved */
    unsigned int LSEN:1;                    /**< \brief [31:31] Lockstep Enable (rw) */
} Ifx_SCU_LCLCON_Bits;

/** \\brief  Manufacturer Identification Register */
typedef struct _Ifx_SCU_MANID_Bits
{
    unsigned int DEPT:5;                    /**< \brief [4:0] Department Identification Number (r) */
    unsigned int MANUF:11;                  /**< \brief [15:5] Manufacturer Identification Number (r) */
    unsigned int reserved_16:16;            /**< \brief \internal Reserved */
} Ifx_SCU_MANID_Bits;

/** \\brief  ESR Output Modification Register */
typedef struct _Ifx_SCU_OMR_Bits
{
    unsigned int PS0:1;                     /**< \brief [0:0] ESRx Pin Set Bit x (w) */
    unsigned int PS1:1;                     /**< \brief [1:1] ESRx Pin Set Bit x (w) */
    unsigned int reserved_2:14;             /**< \brief \internal Reserved */
    unsigned int PCL0:1;                    /**< \brief [16:16] ESRx Pin Clear Bit x (w) */
    unsigned int PCL1:1;                    /**< \brief [17:17] ESRx Pin Clear Bit x (w) */
    unsigned int reserved_18:14;            /**< \brief \internal Reserved */
} Ifx_SCU_OMR_Bits;

/** \\brief  OSC Control Register */
typedef struct _Ifx_SCU_OSCCON_Bits
{
    unsigned int reserved_0:1;              /**< \brief \internal Reserved */
    unsigned int PLLLV:1;                   /**< \brief [1:1] Oscillator for PLL Valid Low Status Bit (rh) */
    unsigned int OSCRES:1;                  /**< \brief [2:2] Oscillator Watchdog Reset (w) */
    unsigned int GAINSEL:2;                 /**< \brief [4:3] Oscillator Gain Selection (rw) */
    unsigned int MODE:2;                    /**< \brief [6:5] Oscillator Mode (rw) */
    unsigned int SHBY:1;                    /**< \brief [7:7] Shaper Bypass (rw) */
    unsigned int PLLHV:1;                   /**< \brief [8:8] Oscillator for PLL Valid High Status Bit (rh) */
    unsigned int reserved_9:1;              /**< \brief \internal Reserved */
    unsigned int X1D:1;                     /**< \brief [10:10] XTAL1 Data Value (rh) */
    unsigned int X1DEN:1;                   /**< \brief [11:11] XTAL1 Data Enable (rw) */
    unsigned int reserved_12:4;             /**< \brief \internal Reserved */
    unsigned int OSCVAL:5;                  /**< \brief [20:16] OSC Frequency Value (rw) */
    unsigned int reserved_21:2;             /**< \brief \internal Reserved */
    unsigned int APREN:1;                   /**< \brief [23:23] Amplitude Regulation Enable (rw) */
    unsigned int CAP0EN:1;                  /**< \brief [24:24] Capacitance 0 Enable (rw) */
    unsigned int CAP1EN:1;                  /**< \brief [25:25] Capacitance 1 Enable (rw) */
    unsigned int CAP2EN:1;                  /**< \brief [26:26] Capacitance 2 Enable (rw) */
    unsigned int CAP3EN:1;                  /**< \brief [27:27] Capacitance 3 Enable (rw) */
    unsigned int reserved_28:4;             /**< \brief \internal Reserved */
} Ifx_SCU_OSCCON_Bits;

/** \\brief  ESR Output Register */
typedef struct _Ifx_SCU_OUT_Bits
{
    unsigned int P0:1;                      /**< \brief [0:0] Output Bit x (rwh) */
    unsigned int P1:1;                      /**< \brief [1:1] Output Bit x (rwh) */
    unsigned int reserved_2:30;             /**< \brief \internal Reserved */
} Ifx_SCU_OUT_Bits;

/** \\brief  Overlay Control Register */
typedef struct _Ifx_SCU_OVCCON_Bits
{
    unsigned int CSEL0:1;                   /**< \brief [0:0] CPU Select x (w) */
    unsigned int CSEL1:1;                   /**< \brief [1:1] CPU Select x (w) */
    unsigned int CSEL2:1;                   /**< \brief [2:2] CPU Select x (w) */
    unsigned int reserved_3:5;              /**< \brief \internal Reserved */
    unsigned int PEND0:1;                   /**< \brief [8:8] CPU Pending x (w) */
    unsigned int PEND1:1;                   /**< \brief [9:9] CPU Pending x (w) */
    unsigned int PEND2:1;                   /**< \brief [10:10] CPU Pending x (w) */
    unsigned int reserved_11:5;             /**< \brief \internal Reserved */
    unsigned int OVSTRT:1;                  /**< \brief [16:16] Overlay Start (w) */
    unsigned int OVSTP:1;                   /**< \brief [17:17] Overlay Stop (w) */
    unsigned int DCINVAL:1;                 /**< \brief [18:18] Data Cache Invalidate (w) */
    unsigned int reserved_19:5;             /**< \brief \internal Reserved */
    unsigned int OVCONF:1;                  /**< \brief [24:24] Overlay Configured (rw) */
    unsigned int POVCONF:1;                 /**< \brief [25:25] Write Protection for OVCONF (w) */
    unsigned int reserved_26:6;             /**< \brief \internal Reserved */
} Ifx_SCU_OVCCON_Bits;

/** \\brief  Overlay Enable Register */
typedef struct _Ifx_SCU_OVCENABLE_Bits
{
    unsigned int OVEN0:1;                   /**< \brief [0:0] Overlay Enable x (rw) */
    unsigned int OVEN1:1;                   /**< \brief [1:1] Overlay Enable x (rw) */
    unsigned int OVEN2:1;                   /**< \brief [2:2] Overlay Enable x (rw) */
    unsigned int reserved_3:29;             /**< \brief \internal Reserved */
} Ifx_SCU_OVCENABLE_Bits;

/** \\brief  Pad Disable Control Register */
typedef struct _Ifx_SCU_PDISC_Bits
{
    unsigned int PDIS0:1;                   /**< \brief [0:0] Pad Disable for ESR Pin x (rw) */
    unsigned int PDIS1:1;                   /**< \brief [1:1] Pad Disable for ESR Pin x (rw) */
    unsigned int reserved_2:30;             /**< \brief \internal Reserved */
} Ifx_SCU_PDISC_Bits;

/** \\brief  Pattern Detection Result Register */
typedef struct _Ifx_SCU_PDRR_Bits
{
    unsigned int PDR0:1;                    /**< \brief [0:0] Pattern Detection Result of Channel y (rh) */
    unsigned int PDR1:1;                    /**< \brief [1:1] Pattern Detection Result of Channel y (rh) */
    unsigned int PDR2:1;                    /**< \brief [2:2] Pattern Detection Result of Channel y (rh) */
    unsigned int PDR3:1;                    /**< \brief [3:3] Pattern Detection Result of Channel y (rh) */
    unsigned int PDR4:1;                    /**< \brief [4:4] Pattern Detection Result of Channel y (rh) */
    unsigned int PDR5:1;                    /**< \brief [5:5] Pattern Detection Result of Channel y (rh) */
    unsigned int PDR6:1;                    /**< \brief [6:6] Pattern Detection Result of Channel y (rh) */
    unsigned int PDR7:1;                    /**< \brief [7:7] Pattern Detection Result of Channel y (rh) */
    unsigned int reserved_8:24;             /**< \brief \internal Reserved */
} Ifx_SCU_PDRR_Bits;

