HAMES2-1st-3/TunnelComfortSystemTesting/include/tc27xa/IfxScu_regdef.h
/** \\brief  PLL Configuration 0 Register */
typedef struct _Ifx_SCU_PLLCON0_Bits
{
    unsigned int VCOBYP:1;                  /**< \brief [0:0] VCO Bypass (rw) */
    unsigned int VCOPWD:1;                  /**< \brief [1:1] VCO Power Saving Mode (rw) */
    unsigned int MODEN:1;                   /**< \brief [2:2] Modulation Enable (rw) */
    unsigned int CEN:1;                     /**< \brief [3:3] Clipping Enable (rw) */
    unsigned int SETFINDIS:1;               /**< \brief [4:4] Set Status Bit PLLSTATFINDIS (w) */
    unsigned int CLRFINDIS:1;               /**< \brief [5:5] Clear Status Bit PLLSTATFINDIS (w) */
    unsigned int OSCDISCDIS:1;              /**< \brief [6:6] Oscillator Disconnect Disable (rw) */
    unsigned int reserved_7:2;              /**< \brief \internal Reserved */
    unsigned int NDIV:7;                    /**< \brief [15:9] N-Divider Value (rw) */
    unsigned int PLLPWD:1;                  /**< \brief [16:16] PLL Power Saving Mode (rw) */
    unsigned int reserved_17:1;             /**< \brief \internal Reserved */
    unsigned int RESLD:1;                   /**< \brief [18:18] Restart VCO Lock Detection (w) */
    unsigned int reserved_19:5;             /**< \brief \internal Reserved */
    unsigned int PDIV:4;                    /**< \brief [27:24] P-Divider Value (rw) */
    unsigned int reserved_28:4;             /**< \brief \internal Reserved */
} Ifx_SCU_PLLCON0_Bits;

/** \\brief  PLL Configuration 1 Register */
typedef struct _Ifx_SCU_PLLCON1_Bits
{
    unsigned int K2DIV:7;                   /**< \brief [6:0] K2-Divider Value (rw) */
    unsigned int reserved_7:9;              /**< \brief \internal Reserved */
    unsigned int K1DIV:7;                   /**< \brief [22:16] K1-Divider Value (rw) */
    unsigned int reserved_23:9;             /**< \brief \internal Reserved */
} Ifx_SCU_PLLCON1_Bits;

/** \\brief  PLL Configuration 2 Register */
typedef struct _Ifx_SCU_PLLCON2_Bits
{
    unsigned int MODAMP:16;                 /**< \brief [15:0] Modulation Amplitude (rw) */
    unsigned int MODFREQ:16;                /**< \brief [31:16] Modulation Frequency (rw) */
} Ifx_SCU_PLLCON2_Bits;

/** \\brief  PLL_ERAY Configuration 0 Register */
typedef struct _Ifx_SCU_PLLERAYCON0_Bits
{
    unsigned int VCOBYP:1;                  /**< \brief [0:0] VCO Bypass (rw) */
    unsigned int VCOPWD:1;                  /**< \brief [1:1] VCO Power Saving Mode (rw) */
    unsigned int reserved_2:2;              /**< \brief \internal Reserved */
    unsigned int SETFINDIS:1;               /**< \brief [4:4] Set Status Bit PLLERAYSTATFINDIS (w) */
    unsigned int CLRFINDIS:1;               /**< \brief [5:5] Clear Status Bit PLLERAYSTATFINDIS (w) */
    unsigned int OSCDISCDIS:1;              /**< \brief [6:6] Oscillator Disconnect Disable (rw) */
    unsigned int reserved_7:2;              /**< \brief \internal Reserved */
    unsigned int NDIV:5;                    /**< \brief [13:9] N-Divider Value (rw) */
    unsigned int reserved_14:2;             /**< \brief \internal Reserved */
    unsigned int PLLPWD:1;                  /**< \brief [16:16] PLL Power Saving Mode (rw) */
    unsigned int reserved_17:1;             /**< \brief \internal Reserved */
    unsigned int RESLD:1;                   /**< \brief [18:18] Restart VCO Lock Detection (w) */
    unsigned int reserved_19:5;             /**< \brief \internal Reserved */
    unsigned int PDIV:4;                    /**< \brief [27:24] P-Divider Value (rw) */
    unsigned int reserved_28:4;             /**< \brief \internal Reserved */
} Ifx_SCU_PLLERAYCON0_Bits;

/** \\brief  PLL_ERAY Configuration 1 Register */
typedef struct _Ifx_SCU_PLLERAYCON1_Bits
{
    unsigned int K2DIV:7;                   /**< \brief [6:0] K2-Divider Value (rw) */
    unsigned int reserved_7:9;              /**< \brief \internal Reserved */
    unsigned int K1DIV:7;                   /**< \brief [22:16] K1-Divider Value (rw) */
    unsigned int reserved_23:9;             /**< \brief \internal Reserved */
} Ifx_SCU_PLLERAYCON1_Bits;

/** \\brief  PLL_ERAY Status Register */
typedef struct _Ifx_SCU_PLLERAYSTAT_Bits
{
    unsigned int VCOBYST:1;                 /**< \brief [0:0] VCO Bypass Status (rh) */
    unsigned int PWDSTAT:1;                 /**< \brief [1:1] PLL_ERAY Power-saving Mode Status (rh) */
    unsigned int VCOLOCK:1;                 /**< \brief [2:2] PLL VCO Lock Status (rh) */
    unsigned int FINDIS:1;                  /**< \brief [3:3] Input Clock Disconnect Select Status (rh) */
    unsigned int K1RDY:1;                   /**< \brief [4:4] K1 Divider Ready Status (rh) */
    unsigned int K2RDY:1;                   /**< \brief [5:5] K2 Divider Ready Status (rh) */
    unsigned int BY:1;                      /**< \brief [6:6] Bypass Mode Status (rh) */
    unsigned int reserved_7:25;             /**< \brief \internal Reserved */
} Ifx_SCU_PLLERAYSTAT_Bits;

/** \\brief  PLL Status Register */
typedef struct _Ifx_SCU_PLLSTAT_Bits
{
    unsigned int VCOBYST:1;                 /**< \brief [0:0] VCO Bypass Status (rh) */
    unsigned int PWDSTAT:1;                 /**< \brief [1:1] PLL Power-saving Mode Status (rh) */
    unsigned int VCOLOCK:1;                 /**< \brief [2:2] PLL VCO Lock Status (rh) */
    unsigned int FINDIS:1;                  /**< \brief [3:3] Input Clock Disconnect Select Status (rh) */
    unsigned int K1RDY:1;                   /**< \brief [4:4] K1 Divider Ready Status (rh) */
    unsigned int K2RDY:1;                   /**< \brief [5:5] K2 Divider Ready Status (rh) */
    unsigned int BY:1;                      /**< \brief [6:6] Bypass Mode Status (rh) */
    unsigned int MODRUN:1;                  /**< \brief [7:7] Modulation Run (rh) */
    unsigned int reserved_8:24;             /**< \brief \internal Reserved */
} Ifx_SCU_PLLSTAT_Bits;

/** \\brief  Power Management Control and Status Register */
typedef struct _Ifx_SCU_PMCSR_Bits
{
    unsigned int REQSLP:2;                  /**< \brief [1:0] Idle Mode and Sleep Mode Request (rwh) */
    unsigned int SMUSLP:1;                  /**< \brief [2:2] SMU CPU Idle Request (rwh) */
    unsigned int RSTSLP:1;                  /**< \brief [3:3] Reset Controller CPU Idle Request (rwh) */
    unsigned int reserved_4:4;              /**< \brief \internal Reserved */
    unsigned int PMST:3;                    /**< \brief [10:8] Power management Status (rh) */
    unsigned int reserved_11:21;            /**< \brief \internal Reserved */
} Ifx_SCU_PMCSR_Bits;

/** \\brief  Standby and Wake-up Control Register 0 */
typedef struct _Ifx_SCU_PMSWCR0_Bits
{
    unsigned int ESR0WKEN:1;                /**< \brief [0:0] ESR0 Wake-up enable from Standby (rw) */
    unsigned int ESR1WKEN:1;                /**< \brief [1:1] ESR1 Wake-up enable from Standby (rw) */
    unsigned int PINAWKEN:1;                /**< \brief [2:2] Pin A Wake-up enable from Standby (rw) */
    unsigned int PINBWKEN:1;                /**< \brief [3:3] Pin B Wake-up enable from Standby (rw) */
    unsigned int ESR0DFEN:1;                /**< \brief [4:4] Digital Filter Enable (rw) */
    unsigned int ESR0EDCON:2;               /**< \brief [6:5] Edge Detection Control (rw) */
    unsigned int ESR1DFEN:1;                /**< \brief [7:7] Digital Filter Enable (rw) */
    unsigned int ESR1EDCON:2;               /**< \brief [9:8] Edge Detection Control (rw) */
    unsigned int PINADFEN:1;                /**< \brief [10:10] Digital Filter Enable (rw) */
    unsigned int PINAEDCON:2;               /**< \brief [12:11] Edge Detection Control (rw) */
    unsigned int PINBDFEN:1;                /**< \brief [13:13] Digital Filter Enable (rw) */
    unsigned int PINBEDCON:2;               /**< \brief [15:14] Edge Detection Control (rw) */
    unsigned int reserved_16:1;             /**< \brief \internal Reserved */
    unsigned int STBYRAMSEL:2;              /**< \brief [18:17] Standby RAM supply in Standby Mode (rw) */
    unsigned int reserved_19:2;             /**< \brief \internal Reserved */
    unsigned int TRISTEN:1;                 /**< \brief [21:21] Bit protection for Tristate request bit TRISTREQ (rw) */
    unsigned int TRISTREQ:1;                /**< \brief [22:22] Tristate enable (rw) */
    unsigned int PORSTDF:1;                 /**< \brief [23:23] PORST Digital Filter enable (rw) */
    unsigned int PORSTWKP:1;                /**< \brief [24:24] Standby - Wakeup transition on PORST edges (rw) */
    unsigned int DCDCSYNC:1;                /**< \brief [25:25] DC-DC Synchronisation Enable (rw) */
    unsigned int reserved_26:5;             /**< \brief \internal Reserved */
    unsigned int LCK:1;                     /**< \brief [31:31] Lock Status (rh) */
} Ifx_SCU_PMSWCR0_Bits;

