HAMES2-1st-3/TunnelComfortSystemTesting/include/tc27xa/IfxScu_regdef.h
/** \\brief  Standby and Wake-up Control Register 1 */
typedef struct _Ifx_SCU_PMSWCR1_Bits
{
    unsigned int reserved_0:8;              /**< \brief \internal Reserved */
    unsigned int CPU0IDLE:1;                /**< \brief [8:8] CPU0 IDLE request (w) */
    unsigned int CPU1IDLE:1;                /**< \brief [9:9] CPU1 IDLE request (w) */
    unsigned int CPU2IDLE:1;                /**< \brief [10:10] CPU2 IDLE request (w) */
    unsigned int reserved_11:13;            /**< \brief \internal Reserved */
    unsigned int CPUSEL:3;                  /**< \brief [26:24] CPU selection for Sleep and Standby mode (rw) */
    unsigned int reserved_27:4;             /**< \brief \internal Reserved */
    unsigned int LCK:1;                     /**< \brief [31:31] Lock Status (rh) */
} Ifx_SCU_PMSWCR1_Bits;

/** \\brief  Standby and Wake-up Control Register 2 */
typedef struct _Ifx_SCU_PMSWCR2_Bits
{
    unsigned int SCRINT:8;                  /**< \brief [7:0] Data exchange from Standby Controller to SCU (r) */
    unsigned int BUSY:1;                    /**< \brief [8:8] SCR Arbiter Busy status flag (rh) */
    unsigned int SCRECC:1;                  /**< \brief [9:9] SCR RAM ECC error / reset flag (rh) */
    unsigned int SCRWDT:1;                  /**< \brief [10:10] SCR Watchdog Timer error / reset flag (rh) */
    unsigned int SCRRST:1;                  /**< \brief [11:11] SCR Software reset flag (rh) */
    unsigned int reserved_12:4;             /**< \brief \internal Reserved */
    unsigned int TCINT:8;                   /**< \brief [23:16] Data exchange from SCU to Standby Controller (rw) */
    unsigned int TCINTREQ:1;                /**< \brief [24:24] SW Interrupt request from SCU to Standby Controller (rw) */
    unsigned int SMURST:1;                  /**< \brief [25:25] SMU Reset indication flag (rh) */
    unsigned int RST:1;                     /**< \brief [26:26] Application or System Reset indication flag (rh) */
    unsigned int reserved_27:4;             /**< \brief \internal Reserved */
    unsigned int LCK:1;                     /**< \brief [31:31] Lock Status (rh) */
} Ifx_SCU_PMSWCR2_Bits;

/** \\brief  Standby and Wake-up Status Flag Register */
typedef struct _Ifx_SCU_PMSWSTAT_Bits
{
    unsigned int ESR0WKP:1;                 /**< \brief [0:0] ESR0 Wake-up flag (rh) */
    unsigned int ESR0OVRUN:1;               /**< \brief [1:1] ESR0 Overrun status flag (rh) */
    unsigned int ESR1WKP:1;                 /**< \brief [2:2] ESR1 Wake-up flag (rh) */
    unsigned int ESR1OVRUN:1;               /**< \brief [3:3] ESR1 Overrun status flag (rh) */
    unsigned int PINAWKP:1;                 /**< \brief [4:4] Pin A Wake-up flag (rh) */
    unsigned int PINAOVRUN:1;               /**< \brief [5:5] Pin A Overrun status flag (rh) */
    unsigned int PINBWKP:1;                 /**< \brief [6:6] Pin B Wake-up flag (rh) */
    unsigned int PINBOVRUN:1;               /**< \brief [7:7] Pin B Overrun status flag (rh) */
    unsigned int PORSTWKP:1;                /**< \brief [8:8] Standby-Wakeup transition on PORST edges (rh) */
    unsigned int PORSTDF:1;                 /**< \brief [9:9] PORST Digital Filter status (rh) */
    unsigned int HWCFGEVR:3;                /**< \brief [12:10] EVR Hardware Configuration (rh) */
    unsigned int STBYRAM:2;                 /**< \brief [14:13] Standby RAM Supply status (rh) */
    unsigned int TRIST:1;                   /**< \brief [15:15] Pad Tristate / Pull-up status (rh) */
    unsigned int reserved_16:3;             /**< \brief \internal Reserved */
    unsigned int SPARE0:5;                  /**< \brief [23:19] Spare bits (rh) */
    unsigned int reserved_24:8;             /**< \brief \internal Reserved */
} Ifx_SCU_PMSWSTAT_Bits;

/** \\brief  Standby and Wake-up Status Clear Register */
typedef struct _Ifx_SCU_PMSWSTATCLR_Bits
{
    unsigned int ESR0WKPCLR:1;              /**< \brief [0:0] ESR0 Wake-up indication flag clear (w) */
    unsigned int ESR0OVRUNCLR:1;            /**< \brief [1:1] ESR0 Overrun status indication flag clear (w) */
    unsigned int ESR1WKPCLR:1;              /**< \brief [2:2] ESR1 Wake-up indication flag clear (w) */
    unsigned int ESR1OVRUNCLR:1;            /**< \brief [3:3] ESR1 Overrun status indication flag clear (w) */
    unsigned int PINAWKPCLR:1;              /**< \brief [4:4] PINA Wake-up indication flag clear (w) */
    unsigned int PINAOVRUNCLR:1;            /**< \brief [5:5] PINA Overrun status indication flag clear (w) */
    unsigned int PINBWKPCLR:1;              /**< \brief [6:6] PINB Wake-up indication flag clear (w) */
    unsigned int PINBOVRUNCLR:1;            /**< \brief [7:7] PINB Overrun status indication flag clear (w) */
    unsigned int reserved_8:11;             /**< \brief \internal Reserved */
    unsigned int SPARECLR:5;                /**< \brief [23:19] SPARE flag clear (w) */
    unsigned int reserved_24:8;             /**< \brief \internal Reserved */
} Ifx_SCU_PMSWSTATCLR_Bits;

/** \\brief  Additional Reset Control Register */
typedef struct _Ifx_SCU_RSTCON2_Bits
{
    unsigned int FRTO:1;                    /**< \brief [0:0] Force Reset Timeout (rw) */
    unsigned int CLRC:1;                    /**< \brief [1:1] Clear Cold Reset Status (w) */
    unsigned int reserved_2:8;              /**< \brief \internal Reserved */
    unsigned int FLSS:2;                    /**< \brief [11:10] Flash Safe State Reached (rh) */
    unsigned int CSS:3;                     /**< \brief [14:12] CPU Safe State Reached (rh) */
    unsigned int MCDSSS:1;                  /**< \brief [15:15] MCDS Safe State Reached (rh) */
    unsigned int USRINFO:16;                /**< \brief [31:16] User Information (rw) */
} Ifx_SCU_RSTCON2_Bits;

/** \\brief  Reset Configuration Register */
typedef struct _Ifx_SCU_RSTCON_Bits
{
    unsigned int ESR0:2;                    /**< \brief [1:0] ESR0 Reset Request Trigger Reset Configuration (rw) */
    unsigned int ESR1:2;                    /**< \brief [3:2] ESR1 Reset Request Trigger Reset Configuration (rw) */
    unsigned int reserved_4:2;              /**< \brief \internal Reserved */
    unsigned int SMU:2;                     /**< \brief [7:6] SMU Reset Request Trigger Reset Configuration (rw) */
    unsigned int SW:2;                      /**< \brief [9:8] SW Reset Request Trigger Reset Configuration (rw) */
    unsigned int STM0:2;                    /**< \brief [11:10] STM0 Reset Request Trigger Reset Configuration (rw) */
    unsigned int STM1:2;                    /**< \brief [13:12] STM1 Reset Request Trigger Reset Configuration (rw) */
    unsigned int STM2:2;                    /**< \brief [15:14] STM2 Reset Request Trigger Reset Configuration (rw) */
    unsigned int reserved_16:16;            /**< \brief \internal Reserved */
} Ifx_SCU_RSTCON_Bits;

/** \\brief  Reset Status Register */
typedef struct _Ifx_SCU_RSTSTAT_Bits
{
    unsigned int ESR0:1;                    /**< \brief [0:0] Reset Request Trigger Reset Status for ESR0 (rh) */
    unsigned int ESR1:1;                    /**< \brief [1:1] Reset Request Trigger Reset Status for ESR1 (rh) */
    unsigned int reserved_2:1;              /**< \brief \internal Reserved */
    unsigned int SMU:1;                     /**< \brief [3:3] Reset Request Trigger Reset Status for SMU (rh) */
    unsigned int SW:1;                      /**< \brief [4:4] Reset Request Trigger Reset Status for SW (rh) */
    unsigned int STM0:1;                    /**< \brief [5:5] Reset Request Trigger Reset Status for STM0 (rh) */
    unsigned int STM1:1;                    /**< \brief [6:6] Reset Request Trigger Reset Status for STM1 (rh) */
    unsigned int STM2:1;                    /**< \brief [7:7] Reset Request Trigger Reset Status for STM2 (rh) */
    unsigned int reserved_8:8;              /**< \brief \internal Reserved */
    unsigned int PORST:1;                   /**< \brief [16:16] Reset Request Trigger Reset Status for PORST (rh) */
    unsigned int reserved_17:1;             /**< \brief \internal Reserved */
    unsigned int CB0:1;                     /**< \brief [18:18] Reset Request Trigger Reset Status for Cerberus System Reset (rh) */
    unsigned int CB1:1;                     /**< \brief [19:19] Reset Request Trigger Reset Status for Cerberus Debug Reset (rh) */
    unsigned int CB3:1;                     /**< \brief [20:20] Reset Request Trigger Reset Status for Cerberus Application Reset (rh) */
    unsigned int TP:1;                      /**< \brief [21:21] Reset Request Trigger Reset Status for Tuning Protection (rh) */
    unsigned int TCU:1;                     /**< \brief [22:22] Reset Request Trigger Reset Status for TCU (r) */
    unsigned int EVR13:1;                   /**< \brief [23:23] Reset Request Trigger Reset Status for EVR13 (rh) */
    unsigned int EVR33:1;                   /**< \brief [24:24] Reset Request Trigger Reset Status for EVR33 (rh) */
    unsigned int SWD:1;                     /**< \brief [25:25] Reset Request Trigger Reset Status for Supply Watchdog SWD (rh) */
    unsigned int HSMS:1;                    /**< \brief [26:26] Reset Request Trigger Reset Status for HSM System Reset HSM S (rh) */
    unsigned int HSMA:1;                    /**< \brief [27:27] Reset Request Trigger Reset Status for HSM Application Reset HSM A (rh) */
    unsigned int STBYR:1;                   /**< \brief [28:28] Reset Request Trigger Reset Status for Standby Regulator Watchdog STBYR (rh) */
    unsigned int reserved_29:3;             /**< \brief \internal Reserved */
} Ifx_SCU_RSTSTAT_Bits;

/** \\brief  Start-up Configuration Register */
typedef struct _Ifx_SCU_STCON_Bits
{
    unsigned int HWCFG:8;                   /**< \brief [7:0] Hardware Configuration Setting (w) */
    unsigned int reserved_8:5;              /**< \brief \internal Reserved */
    unsigned int SFCBAE:1;                  /**< \brief [13:13] Set Flash Config Sector Access Enable (w) */
    unsigned int CFCBAE:1;                  /**< \brief [14:14] Clear Flash Config Sector Access Enable (w) */
    unsigned int STP:1;                     /**< \brief [15:15] Start-up Protection Setting (rwh) */
    unsigned int reserved_16:16;            /**< \brief \internal Reserved */
} Ifx_SCU_STCON_Bits;

/** \\brief  Start-up Status Register */
typedef struct _Ifx_SCU_STSTAT_Bits
{
    unsigned int HWCFG:8;                   /**< \brief [7:0] Hardware Configuration Setting (rh) */
    unsigned int reserved_8:7;              /**< \brief \internal Reserved */
    unsigned int MODE:1;                    /**< \brief [15:15] MODE (rh) */
    unsigned int FCBAE:1;                   /**< \brief [16:16] Flash Config Sector Access Enable (rh) */
    unsigned int LUDIS:1;                   /**< \brief [17:17] Latch Update Disable (rh) */
    unsigned int reserved_18:1;             /**< \brief \internal Reserved */
    unsigned int TRSTL:1;                   /**< \brief [19:19] TRSTL Status (rh) */
    unsigned int SPDEN:1;                   /**< \brief [20:20] Single Pin DAP Mode Enable (rh) */
    unsigned int OTPOFF:1;                  /**< \brief [21:21] OTP Over-ruled (rh) */
    unsigned int FSIOFF:1;                  /**< \brief [22:22] FSI Disabled (rh) */
    unsigned int STPOVREQ:1;                /**< \brief [23:23] Start-Up Protection Over-ruling Request (rh) */
    unsigned int RAMINT:1;                  /**< \brief [24:24] RAM Content Security Integrity (rh) */
    unsigned int reserved_25:7;             /**< \brief \internal Reserved */
} Ifx_SCU_STSTAT_Bits;

