HAMES2-1st-3/TunnelComfortSystemTesting/include/tc27xa/IfxScu_regdef.h
/** \\brief  Software Reset Configuration Register */
typedef struct _Ifx_SCU_SWRSTCON_Bits
{
    unsigned int SWBOOT:1;                  /**< \brief [0:0] Software Boot Configuration Selection (rw) */
    unsigned int SWRSTREQ:1;                /**< \brief [1:1] Software Reset Request (w) */
    unsigned int reserved_2:6;              /**< \brief \internal Reserved */
    unsigned int SWCFG:8;                   /**< \brief [15:8] Software Boot Configuration (rw) */
    unsigned int reserved_16:16;            /**< \brief \internal Reserved */
} Ifx_SCU_SWRSTCON_Bits;

/** \\brief  System Control Register */
typedef struct _Ifx_SCU_SYSCON_Bits
{
    unsigned int CCTRIG0:1;                 /**< \brief [0:0] Capture Compare Trigger x (rw) */
    unsigned int CCTRIG1:1;                 /**< \brief [1:1] Capture Compare Trigger x (rw) */
    unsigned int RAMINTM:2;                 /**< \brief [3:2] RAM Integrity Modify (w) */
    unsigned int SETLUDIS:1;                /**< \brief [4:4] Set Latch Update Disable (w) */
    unsigned int reserved_5:3;              /**< \brief \internal Reserved */
    unsigned int DATM:1;                    /**< \brief [8:8] Disable Application Test Mode ATM (rw) */
    unsigned int reserved_9:23;             /**< \brief \internal Reserved */
} Ifx_SCU_SYSCON_Bits;

/** \\brief  Trap Clear Register */
typedef struct _Ifx_SCU_TRAPCLR_Bits
{
    unsigned int ESR0T:1;                   /**< \brief [0:0] Clear Trap Request Flag ESR0T (w) */
    unsigned int ESR1T:1;                   /**< \brief [1:1] Clear Trap Request Flag ESR1T (w) */
    unsigned int reserved_2:1;              /**< \brief \internal Reserved */
    unsigned int SMUT:1;                    /**< \brief [3:3] Clear Trap Request Flag SMUT (w) */
    unsigned int reserved_4:28;             /**< \brief \internal Reserved */
} Ifx_SCU_TRAPCLR_Bits;

/** \\brief  Trap Disable Register */
typedef struct _Ifx_SCU_TRAPDIS_Bits
{
    unsigned int ESR0T:1;                   /**< \brief [0:0] Disable Trap Request ESR0T (rw) */
    unsigned int ESR1T:1;                   /**< \brief [1:1] Disable Trap Request ESR1T (rw) */
    unsigned int reserved_2:1;              /**< \brief \internal Reserved */
    unsigned int SMUT:1;                    /**< \brief [3:3] Disable Trap Request SMUT (rw) */
    unsigned int reserved_4:28;             /**< \brief \internal Reserved */
} Ifx_SCU_TRAPDIS_Bits;

/** \\brief  Trap Set Register */
typedef struct _Ifx_SCU_TRAPSET_Bits
{
    unsigned int ESR0T:1;                   /**< \brief [0:0] Set Trap Request Flag ESR0T (w) */
    unsigned int ESR1T:1;                   /**< \brief [1:1] Set Trap Request Flag ESR1T (w) */
    unsigned int reserved_2:1;              /**< \brief \internal Reserved */
    unsigned int SMUT:1;                    /**< \brief [3:3] Set Trap Request Flag SMUT (w) */
    unsigned int reserved_4:28;             /**< \brief \internal Reserved */
} Ifx_SCU_TRAPSET_Bits;

/** \\brief  Trap Status Register */
typedef struct _Ifx_SCU_TRAPSTAT_Bits
{
    unsigned int ESR0T:1;                   /**< \brief [0:0] ESR0 Trap Request Flag (rh) */
    unsigned int ESR1T:1;                   /**< \brief [1:1] ESR1 Trap Request Flag (rh) */
    unsigned int reserved_2:1;              /**< \brief \internal Reserved */
    unsigned int SMUT:1;                    /**< \brief [3:3] SMU Alarm Trap Request Flag (rh) */
    unsigned int reserved_4:28;             /**< \brief \internal Reserved */
} Ifx_SCU_TRAPSTAT_Bits;

/** \\brief  CPU WDT Control Register 0 */
typedef struct _Ifx_SCU_WDTCPU_CON0_Bits
{
    unsigned int ENDINIT:1;                 /**< \brief [0:0] End-of-Initialization Control Bit (rwh) */
    unsigned int LCK:1;                     /**< \brief [1:1] Lock Bit to Control Access to WDTxCON0 (rwh) */
    unsigned int PW:14;                     /**< \brief [15:2] User-Definable Password Field for Access to WDTxCON0 (rwh) */
    unsigned int REL:16;                    /**< \brief [31:16] Reload Value for the WDT also Time Check Value (rw) */
} Ifx_SCU_WDTCPU_CON0_Bits;

/** \\brief  CPU WDT Control Register 1 */
typedef struct _Ifx_SCU_WDTCPU_CON1_Bits
{
    unsigned int reserved_0:2;              /**< \brief \internal Reserved */
    unsigned int IR0:1;                     /**< \brief [2:2] Input Frequency Request Control (rw) */
    unsigned int DR:1;                      /**< \brief [3:3] Disable Request Control Bit (rw) */
    unsigned int reserved_4:1;              /**< \brief \internal Reserved */
    unsigned int IR1:1;                     /**< \brief [5:5] Input Frequency Request Control (rw) */
    unsigned int UR:1;                      /**< \brief [6:6] Unlock Restriction Request Control Bit (rw) */
    unsigned int PAR:1;                     /**< \brief [7:7] Password Auto-sequence Request Bit (rw) */
    unsigned int TCR:1;                     /**< \brief [8:8] Counter Check Request Bit (rw) */
    unsigned int TCTR:7;                    /**< \brief [15:9] Timer Check Tolerance Request (rh) */
    unsigned int reserved_16:16;            /**< \brief \internal Reserved */
} Ifx_SCU_WDTCPU_CON1_Bits;

/** \\brief  CPU WDT Status Register */
typedef struct _Ifx_SCU_WDTCPU_SR_Bits
{
    unsigned int AE:1;                      /**< \brief [0:0] Watchdog Access Error Status Flag (rh) */
    unsigned int OE:1;                      /**< \brief [1:1] Watchdog Overflow Error Status Flag (rh) */
    unsigned int IS0:1;                     /**< \brief [2:2] Watchdog Input Clock Status (rh) */
    unsigned int DS:1;                      /**< \brief [3:3] Watchdog Enable/Disable Status Flag (rh) */
    unsigned int TO:1;                      /**< \brief [4:4] Watchdog Time-Out Mode Flag (rh) */
    unsigned int IS1:1;                     /**< \brief [5:5] Watchdog Input Clock Status (rh) */
    unsigned int US:1;                      /**< \brief [6:6] SMU Unlock Restriction Status Flag (rh) */
    unsigned int PAS:1;                     /**< \brief [7:7] Password Auto-sequence Status Flag (rh) */
    unsigned int TCS:1;                     /**< \brief [8:8] Timer Check Status Flag (rh) */
    unsigned int TCT:7;                     /**< \brief [15:9] Timer Check Tolerance (rh) */
    unsigned int TIM:16;                    /**< \brief [31:16] Timer Value (rh) */
} Ifx_SCU_WDTCPU_SR_Bits;

/** \\brief  Safety WDT Control Register 0 */
typedef struct _Ifx_SCU_WDTS_CON0_Bits
{
    unsigned int ENDINIT:1;                 /**< \brief [0:0] End-of-Initialization Control Bit (rwh) */
    unsigned int LCK:1;                     /**< \brief [1:1] Lock Bit to Control Access to WDTxCON0 (rwh) */
    unsigned int PW:14;                     /**< \brief [15:2] User-Definable Password Field for Access to WDTxCON0 (rwh) */
    unsigned int REL:16;                    /**< \brief [31:16] Reload Value for the WDT also Time Check Value (rw) */
} Ifx_SCU_WDTS_CON0_Bits;

/** \\brief  Safety WDT Control Register 1 */
typedef struct _Ifx_SCU_WDTS_CON1_Bits
{
    unsigned int CLRIRF:1;                  /**< \brief [0:0] Clear Internal Reset Flag (rwh) */
    unsigned int reserved_1:1;              /**< \brief \internal Reserved */
    unsigned int IR0:1;                     /**< \brief [2:2] Input Frequency Request Control (rw) */
    unsigned int DR:1;                      /**< \brief [3:3] Disable Request Control Bit (rw) */
    unsigned int reserved_4:1;              /**< \brief \internal Reserved */
    unsigned int IR1:1;                     /**< \brief [5:5] Input Frequency Request Control (rw) */
    unsigned int UR:1;                      /**< \brief [6:6] Unlock Restriction Request Control Bit (rw) */
    unsigned int PAR:1;                     /**< \brief [7:7] Password Auto-sequence Request Bit (rw) */
    unsigned int TCR:1;                     /**< \brief [8:8] Counter Check Request Bit (rw) */
    unsigned int TCTR:7;                    /**< \brief [15:9] Timer Check Tolerance Request (rh) */
    unsigned int reserved_16:16;            /**< \brief \internal Reserved */
} Ifx_SCU_WDTS_CON1_Bits;

/** \\brief  Safety WDT Status Register */
typedef struct _Ifx_SCU_WDTS_SR_Bits
{
    unsigned int AE:1;                      /**< \brief [0:0] Watchdog Access Error Status Flag (rh) */
    unsigned int OE:1;                      /**< \brief [1:1] Watchdog Overflow Error Status Flag (rh) */
    unsigned int IS0:1;                     /**< \brief [2:2] Watchdog Input Clock Status (rh) */
    unsigned int DS:1;                      /**< \brief [3:3] Watchdog Enable/Disable Status Flag (rh) */
    unsigned int TO:1;                      /**< \brief [4:4] Watchdog Time-Out Mode Flag (rh) */
    unsigned int IS1:1;                     /**< \brief [5:5] Watchdog Input Clock Status (rh) */
    unsigned int US:1;                      /**< \brief [6:6] SMU Unlock Restriction Status Flag (rh) */
    unsigned int PAS:1;                     /**< \brief [7:7] Password Auto-sequence Status Flag (rh) */
    unsigned int TCS:1;                     /**< \brief [8:8] Timer Check Status Flag (rh) */
    unsigned int TCT:7;                     /**< \brief [15:9] Timer Check Tolerance (rh) */
    unsigned int TIM:16;                    /**< \brief [31:16] Timer Value (rh) */
} Ifx_SCU_WDTS_SR_Bits;
/** \}  */
/******************************************************************************/
/******************************************************************************/
/** \addtogroup IfxLld_Scu_union
 * \{  */

/** \\brief  Access Enable Register 0 */
typedef union
{
    /** \brief Unsigned access */
    unsigned int U;
    /** \brief Signed access */
    signed int I;
    /** \brief Bitfield access */
    Ifx_SCU_ACCEN0_Bits B;
} Ifx_SCU_ACCEN0;

/** \\brief  Access Enable Register 1 */
typedef union
{
    /** \brief Unsigned access */
    unsigned int U;
    /** \brief Signed access */
    signed int I;
    /** \brief Bitfield access */
    Ifx_SCU_ACCEN1_Bits B;
} Ifx_SCU_ACCEN1;

/** \\brief  Application Reset Disable Register */
typedef union
{
    /** \brief Unsigned access */
    unsigned int U;
    /** \brief Signed access */
    signed int I;
    /** \brief Bitfield access */
    Ifx_SCU_ARSTDIS_Bits B;
} Ifx_SCU_ARSTDIS;

/** \\brief  CCU Clock Control Register 0 */
typedef union
{
    /** \brief Unsigned access */
    unsigned int U;
    /** \brief Signed access */
    signed int I;
    /** \brief Bitfield access */
    Ifx_SCU_CCUCON0_Bits B;
} Ifx_SCU_CCUCON0;

/** \\brief  CCU Clock Control Register 1 */
typedef union
{
    /** \brief Unsigned access */
    unsigned int U;
    /** \brief Signed access */
    signed int I;
    /** \brief Bitfield access */
    Ifx_SCU_CCUCON1_Bits B;
} Ifx_SCU_CCUCON1;

